app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 7]]
---
  def show
    @book = Book.find(params[:id])
    @book_comment = BookComment.new
    @book_comments = BookComment.all

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Rails入門"], ["body", "www"], ["user_id", 3], ["created_at", "2020-09-20 04:52:21.058823"], ["updated_at", "2020-09-20 04:52:21.058823"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @book = Book.find(params[:id])