app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "1ec572ecec196a466e2e9f4f3315347485a5bdcb0323c8ced8bfe5a900d4"], ["updated_at", "2020-09-22 05:40:54.299380"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def ensure_correct_user
    @user = User.find(params[:id])