app/models/user.rb

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["user_id", 2], ["follow_id", 1], ["LIMIT", 1]]
INSERT INTO "relationships" ("user_id", "follow_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["follow_id", 1], ["created_at", "2020-09-21 13:01:06.055956"], ["updated_at", "2020-09-21 13:01:06.055956"]]
---
  def follow(other_user)
    unless self == other_user
      unless self.relationships.find_by(follow_id: other_user.id)
             self.relationships.create!(follow_id: other_user.id)

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["user_id", 2], ["follow_id", 1], ["LIMIT", 1]]
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
---
  def unfollow(other_user)
    relationship = self.relationships.find_by(follow_id: other_user.id)
    relationship.destroy if relationship

SELECT  1 AS one FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."follow_id" WHERE "relationships"."user_id" = ? AND "users"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
---
  def following?(other_user)
    self.followings.include?(other_user)